import pandas as pd
from langchain.chains import create_tagging_chain
from langchain.chat_models import ChatOpenAI

DATA_PATH = '/home/arcuser/pain_data.csv'
OPENAI_API_KEY = 'sk-PG0lxPygCcKAL34j7X0ET3BlbkFJmoTVdNInhkTj5eaF'
LABELED_DATA_PATH = '/home/arcuser/labeled_data.xlsx'
schema = {
    "properties": {
        "חומר שהוזרק": {
            "type": "string",
            # "enum": [
            #     '80 מ"ג דפומדרול',
            #     '40 מ"ג דפומדרול',
            #     '20 מ"ג דפומדרול',
            #     '12 מ"ג צלסטון ',
            #     '6 מ"ג צלסטון'
            # ],
            "description": "describes the injected material - not the material that it was mixed with"
        }
    }
}

if __name__ == "__main__":
    llm = ChatOpenAI(temperature=0, openai_api_key=OPENAI_API_KEY, model="gpt-3.5-turbo-0613")
    chain = create_tagging_chain(schema, llm)

    # data = pd.read_excel(DATA_PATH, engine='openpyxl')
    first_row = """
    
    "תאריך: 2/5/23.
          

מוכר למרפאתנו כאבים בעמ""ש מותני ימין יותר משמ  מקרין למותן. 
לאחר חסם באפריל הכאב מימין חלף לגמרי כעת כואב באמצע. נזריק משמ . 
היום לאחר שיחה עם החולה לבירור כי אין שינוי משמעותי במצבו הרפואי הכללי (אשפוזים ותרופות) מאז הפעם האחרונה שנראה במרפאה, ווידוא חוזר כי אינו נוטל מדללי דם, וכי אין רגישות לחומר ניגוד וחומרי הרדמה מקומית המשכנו בדרך המקובלת. ניתן הסבר מפורט לחולה על הסיכונים והתועלת  בטיפול פולשני ודרכי הטיפול ה טרנטיביות. התקבלה הסכמה בעל פה ובכתב מהחולה. בחדר ניתוח, באופן אספטי, עם כיסויים סטרילים, על ידי מחט G Spinal  22 , באורך 10 ס""מ, תחת שקוף נמצאו המפרקים הפאצטלים L4-5 L5-S1  שמ  לאחר ווידוא במנחי AP ו LATERAL הוזרקו 40 מ''ג דפומדרול מהול ב 1 מ""ל של מרקאין 0.5% לכל מפרק. ללא כל סיבוכים מידיים, ללא חזרת דם. ללא כאב או פראסטזיות לא רצויות בזמן הזרקה. לאחר הזרקה יש שיפור מידי בכאב. 
החולה משתחרר לביתו במצב טוב לאחר שעת השגחה. 
. 

הנחיות שניתנו למטופל עם שחרורו:
מומלץ על מנוחה ביום הטיפול וכן חופשת מחלה בת שבועיים ימים בבית.
תרופות בשחרור: כטרם קבלתו.
מומלצת נוכחות מבוגר במחיצת המטופל מספר שעות לאחר הטיפול. 
חל איסור לבצע כל פעולה הכרוכה במאמץ ביום הטיפול.
חל איסור לנהוג לאחר הטיפול והנסיעה חזרה תעשה ברכב פרטי / מונית (לא באוטובוס).
אם מופיעות תלונות חדשות: כאב חדש או החמרת כאב קיים, חולשה, חום, לפנות מיידית לחדר מיון עם מכתב זה.
אם מופיע חסר נוירולוגי חדש: ירידה בתחושה,  ירידה בכח גס, לפנות מיידית לחדר מיון עם מכתב זה.
אם המטופל סובל מיתר לחץ דם יש למדוד ערכי לחץ דם לפחות פעמיים ביום בשבוע הקרוב, לפי הצורך יש לפנות לרופא המטפל.
אם המטופל סובל מסכרת יש למדוד ערכי סוכר בדם לפחות פעמיים ביום בשבוע הקרוב,לפי הצורך יש  לפנות לרופא המטפל.
אם המטופל נוטל תרופות נוגדות קרישה עליו לפנות לרופא המטפל לקבלת הנחיות נוספות , עם מכתב זה. 

מוזמן לחסם חוזר 
הוראות נוספות: אין. 

דר' גור רות נוירוכירורגית
היחידה לשיכוך כאב
המרכז הרפואי חיים שיבא
מ.ר.מ 22509


    """
    result = chain.run(first_row)

    print(result)
